# CORE: Tools required for the dotfiles setup itself.
# Run `make bootstrap` or `make brew-bundle`.
# For GUI apps (Rectangle, Slack, etc.) see Brewfile.apps.

brew "chezmoi"
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"

# Shell (macOS ships zsh by default; not installed via brew)
brew "starship"
brew "atuin"
brew "zoxide"
brew "direnv"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "eza"
brew "bat"
brew "fastfetch"
brew "zsh-syntax-highlighting"
brew "tmux"

# Git
brew "git"
brew "gh"

# Pre-commit guard
brew "pre-commit"
brew "gitleaks"
brew "detect-secrets"
